# Задание №1
name = "Максим"
lastname = "Горький"
print(f"Меня зовут {name} {lastname}")

name = input("Введите имя ")
age = int(input("Введите год рождения "))
place = input("Введите место рождения ")

print(f"Меня зовут {name}. Я родился: {age}г., {place}")
